Revit 2027 API
EnergyDataSettings.SkylightWidth Property
Note: This API is now obsolete.
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate width used for the skylights in massing instances when the Energy Analytical model is being created.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public double SkylightWidth { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property SkylightWidth As Double
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property double SkylightWidth {
	double get ();
	void set (double value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member SkylightWidth : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The skylight width is less than eight inches.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace